<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class RegionsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('regions')->insert([

            ['region' => 'Центральный федеральный округ'],
            ['region' => 'Белгородская область'],
            ['region' => 'Брянская область'],
            ['region' => 'Владимирская область'],
            ['region' => 'Воронежская область'],
            ['region' => 'Ивановская область'],
            ['region' => 'Калужская область'],
            ['region' => 'Костромская область'],
            ['region' => 'Курская область'],
            ['region' => 'Липецкая область'],
            ['region' => 'Московская область'],
            ['region' => 'Орловская область'],
            ['region' => 'Рязанская область'],
            ['region' => 'Смоленская область'],
            ['region' => 'Тамбовская область'],
            ['region' => 'Тверская область'],
            ['region' => 'Тульская область'],
            ['region' => 'Ярославская область'],
            ['region' => 'Москва'],

            ['region' => 'Северо-Западный федеральный округ'],
            ['region' => 'Республика Карелия'],
            ['region' => 'Республика Коми'],
            ['region' => 'Архангельская область'],
            ['region' => 'Ненецкий автономный округ'],
            ['region' => 'Архангельская область и Ненецкий автономный округ'],
            ['region' => 'Вологодская область'],
            ['region' => 'Калининградская область'],
            ['region' => 'Ленинградская область'],
            ['region' => 'Мурманская область'],
            ['region' => 'Новгородская область'],
            ['region' => 'Псковская область'],
            ['region' => 'Санкт-Петербург'],

            ['region' => 'Южный федеральный округ'],
            ['region' => 'Республика Адыгея'],
            ['region' => 'Республика Калмыкия'],
            ['region' => 'Краснодарский край'],
            ['region' => 'Астраханская область'],
            ['region' => 'Волгоградская область'],
            ['region' => 'Ростовская область'],

            ['region' => 'Северо-Кавказский федеральный округ'],
            ['region' => 'Республика Дагестан'],
            ['region' => 'Республика Ингушетия'],
            ['region' => 'Кабардино-Балкарская Республика'],
            ['region' => 'Карачаево-Черкесская Республика'],
            ['region' => 'Республика Северная Осетия – Алания'],
            ['region' => 'Чеченская Республика'],
            ['region' => 'Ставропольский край'],

            ['region' => 'Приволжский федеральный округ'],
            ['region' => 'Республика Башкортостан'],
            ['region' => 'Республика Марий Эл'],
            ['region' => 'Республика Мордовия'],
            ['region' => 'Республика Татарстан'],
            ['region' => 'Удмуртская Республика'],
            ['region' => 'Чувашская Республика'],
            ['region' => 'Пермский край'],
            ['region' => 'Кировская область'],
            ['region' => 'Нижегородская область'],
            ['region' => 'Оренбургская область'],
            ['region' => 'Пензенская область'],
            ['region' => 'Самарская область'],
            ['region' => 'Саратовская область'],
            ['region' => 'Ульяновская область'],

            ['region' => 'Уральский федеральный округ'],
            ['region' => 'Курганская область'],
            ['region' => 'Свердловская область'],
            ['region' => 'Тюменская область'],
            ['region' => 'Ханты-Мансийский автономный округ – Югра'],
            ['region' => 'Ямало-Ненецкий автономный округ'],
            ['region' => 'Тюменская область и округа'],
            ['region' => 'Челябинская область'],

            ['region' => 'Сибирский федеральный округ'],
            ['region' => 'Республика Алтай'],
            ['region' => 'Республика Бурятия'],
            ['region' => 'Республика Тыва'],
            ['region' => 'Республика Хакасия'],
            ['region' => 'Алтайский край'],
            ['region' => 'Забайкальский край'],
            ['region' => 'Красноярский край'],
            ['region' => 'Иркутская область'],
            ['region' => 'Кемеровская область'],
            ['region' => 'Новосибирская область'],
            ['region' => 'Омская область'],
            ['region' => 'Томская область'],

            ['region' => 'Дальневосточный федеральный округ'],
            ['region' => 'Республика Саха (Якутия)'],
            ['region' => 'Камчатский край'],
            ['region' => 'Приморский край'],
            ['region' => 'Хабаровский край'],
            ['region' => 'Амурская область'],
            ['region' => 'Магаданская область'],
            ['region' => 'Сахалинская область'],
            ['region' => 'Еврейская автономная область'],
            ['region' => 'Чукотский автономный округ'],

            ['region' => 'Крымский федеральный округ'],
            ['region' => 'Республика Крым'],
            ['region' => 'г. Севастополь']

        ]);
    }
}
